#Даны 2 действительных числа a и b. Получить их сумму, разность и произведение
a = 5
b = 25
sum = (a+b)
diff = (a-b)
mult = a*b
print ('a+b is:', sum)
print ('a-b is:', diff)
print ('a*b is:', mult)

