#Даны действительные числа x и y. Получить x − y / 1 + xy
x = 66
y = 33
result = (x - y / 1 + x*y)
print ('result of (x − y / 1 + x*y) is:', result)
