# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
x = 10
y = 30
avg = ((x + y) / 2)
geom_m = ((x * y)**(1/2))
print('average is:', avg)
print('Geometric mean is:', geom_m)
